10/data/attachments/953d0fafeaef5e72.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jeffrey_kid_Friend_42506_5</nif:username>
            <nif:friendToBeRequested>soap_friends_fbe1899d-da72-471c-9ef4-4418cf35f086</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>